import React, { Component } from 'react';
import Slider from '../../Components/Slider/Slider';
import { Productdiv } from './style';
import { Card } from 'react-bootstrap';
import { Button } from 'react-bootstrap';
import primage from '../shop/pr.jpg';
class Product extends Component {
    constructor(props) {
        super(props);

    }


    render() {
        return (
            <React.Fragment>
                <Slider />
                <Productdiv className="container">
                    <br />

                    <div className="row">


                        <div className="col-md-6 pp-image"><img className="product-image" src={primage} /></div>
                        <div className="col-md-6 pp-info">
                            <h3>نام محصول</h3>
                            <hr />
                            <h5>توضیحات:</h5>
                            <p className="product-description">لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون با استفاده از طراحان گرافیک گرافیک است، چاپگرها و متون با استفاده از طراحان گرافیک گرافیک است، چاپگرها و متون با استفاده از طراحان گرافیک گرافیک است، چاپگرها و متون با استفاده از طراحان گرافیک گرافیک است، چاپگرها و متون با استفاده از طراحان گرافیک گرافیک است، چاپگرها و متون با استفاده از طراحان گرافیک گرافیک است، چاپگرها و متون با استفاده از طراحان گرافیک گرافیک است، چاپگرها و متون با استفاده از طراحان گرافیک گرافیک است، چاپگرها و متون با استفاده از طراحان گرافیک گرافیک است، چاپگرها و متون با استفاده از طراحان گرافیک گرافیک است، چاپگرها و متون با استفاده از طراحان گرافیک است، چاپگرها و متون</p>
                            <div className="row">
                                <div className="col-md-4 product-id text-center"><p>کد کالا : <span>0001</span></p></div>

                                <div className="col-md-4 add-to-card text-center"><button>افزودن به سبد</button></div>

                                <div className="col-md-4 QNT text-center">تعداد:<input className="QNTinput text-center" type="number" min="0" /></div>

                            </div>
                            <div class="container">

                                <ul class="nav nav-tabs product-multi-info py-2">
                                    <li className="px-0 col-md-3 text-center"><a className="py-2 px-3" data-toggle="tab" href="#menu1">مشخصات</a></li>
                                    <li className="px-0 col-md-3 text-center"><a className="py-2 px-3" data-toggle="tab" href="#menu2">نظرات کاربران</a></li>
                                    <li className="px-0 col-md-3 text-center"><a className="py-2 px-3" data-toggle="tab" href="#menu3">پرسش و پاسخ</a></li>
                                    <li className="px-0 col-md-3 text-center active"><a className="py-2 px-3" data-toggle="tab" href="#home">نقد و بررسی</a></li>
                                </ul>

                                <div class="tab-content product-multi-content px-2 py-3">
                                    <div id="home" className="tab-pane fade in active">
                                        <h5>نقد و بررسی</h5>
                                        <p>راحان گرافیک است، چاپگرها و متون با استفاده از طراحان گرافیک گرافیک است، چاپگرها و متون با استفاده از طراحان گرافیک گرافیک است، چاپگرها و متون با استفاده از طراحان گرافیک گرافیک است، چاپگرها و متون با استفاده از طراحان گرافیک گرافیک است، چاپگرها و متون با استفاده از طراحان گرافیک گرافیک است، چاپگرها و متون با استفاده از طراحان گرافیک گرافیک است، چاپگرها و متون با استفاده از طراحان گرافیک گرافیک است، چاپگرها و متون با استفاده از طراحان گرافیک گرافیک است، چاپگرها و متون با استفاده از طراحان گرافیک گرافیک است، چاپگرها و متون با استفاده از طراحان گرافیک گرافیک است، </p>
                                    </div>
                                    <div id="menu1" className="tab-pane fade">
                                        <h5>مشخصات</h5>
                                        <p>راحان گرافیک است، چاپگرها و متون با استفاده از طراحان گرافیک گرافیک است، چاپگرها و متون با استفاده از طراحان گرافیک گرافیک است، چاپگرها و متون با استفاده از طراحان گرافیک گرافیک است، چاپگرها و متون با استفاده از طراحان گرافیک گرافیک است، چاپگرها و متون با استفاده از طراحان گرافیک گرافیک است، چاپگرها و متون با استفاده از طراحان گرافیک گرافیک است، چاپگرها و متون با استفاده از طراحان گرافیک گرافیک است، چاپگرها و متون با استفاده از طراحان گرافیک گرافیک است، چاپگرها و متون با استفاده از طراحان گرافیک گرافیک است، چاپگرها و متون با استفاده از طراحان گرافیک گرافیک است، </p>
                                    </div>
                                    <div id="menu2" className="tab-pane fade">
                                        <h5>نظرات کاربران</h5>
                                        <p>راحان گرافیک است، چاپگرها و متون با استفاده از طراحان گرافیک گرافیک است، چاپگرها و متون با استفاده از طراحان گرافیک گرافیک است، چاپگرها و متون با استفاده از طراحان گرافیک گرافیک است، چاپگرها و متون با استفاده از طراحان گرافیک گرافیک است، چاپگرها و متون با استفاده از طراحان گرافیک گرافیک است، چاپگرها و متون با استفاده از طراحان گرافیک گرافیک است، چاپگرها و متون با استفاده از طراحان گرافیک گرافیک است، چاپگرها و متون با استفاده از طراحان گرافیک گرافیک است، چاپگرها و متون با استفاده از طراحان گرافیک گرافیک است، چاپگرها و متون با استفاده از طراحان گرافیک گرافیک است، </p>
                                    </div>
                                    <div id="menu3" className="tab-pane fade">
                                        <h5>پرسش و پاسخ</h5>
                                        <p>راحان گرافیک است، چاپگرها و متون با استفاده از طراحان گرافیک گرافیک است، چاپگرها و متون با استفاده از طراحان گرافیک گرافیک است، چاپگرها و متون با استفاده از طراحان گرافیک گرافیک است، چاپگرها و متون با استفاده از طراحان گرافیک گرافیک است، چاپگرها و متون با استفاده از طراحان گرافیک گرافیک است، چاپگرها و متون با استفاده از طراحان گرافیک گرافیک است، چاپگرها و متون با استفاده از طراحان گرافیک گرافیک است، چاپگرها و متون با استفاده از طراحان گرافیک گرافیک است، چاپگرها و متون با استفاده از طراحان گرافیک گرافیک است، چاپگرها و متون با استفاده از طراحان گرافیک گرافیک است، </p>
                                    </div>
                                </div>
                            </div>

                        </div>


                    </div>



                </Productdiv>



            </React.Fragment>
        );
    }
}
export default Product;
